# 연습문제 1

In [2]:
import numpy as np, pandas as pd
a = pd.DataFrame(np.arange(9).reshape(3,3),
                index = ['a','b','c'],
                columns =['Ohio','Texas','California'])
a

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

# Series : Reindexing

In [3]:
a['Ohio']

a    0
b    3
c    6
Name: Ohio, dtype: int32

In [4]:
pd.Series(a.Ohio, index = ['d','b','a','c'])

d    NaN
b    3.0
a    0.0
c    6.0
Name: Ohio, dtype: float64

In [5]:
a.Ohio.reindex(sorted('abcd',reverse=True))

d    NaN
c    6.0
b    3.0
a    0.0
Name: Ohio, dtype: float64

In [6]:
b = a.Ohio
b

a    0
b    3
c    6
Name: Ohio, dtype: int32

In [7]:
b.index = ['c','b','a']
b

c    0
b    3
a    6
Name: Ohio, dtype: int32

In [8]:
b.reindex(list('abcd'))

a    6.0
b    3.0
c    0.0
d    NaN
Name: Ohio, dtype: float64

# DataFrame: Reindexing

In [9]:
a.reindex(columns = ['Texas','Utah','California'],
         index = ['a','b','c'])
a

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [10]:
a.reindex(columns = ['Texas','Utah','California'],
         index = ['a','b','c'], fill_value = 0) # reindexing 중에 생성된 nan을 0으로 채움

   Texas  Utah  California
a      1     0           2
b      4     0           5
c      7     0           8

# drop: Series

In [11]:
a = pd.Series(np.arange(5.), index = list('abcde'))

In [12]:
a

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [13]:
del a['a']

In [16]:
a.drop('c')
a.drop(['e','d'])

b    1.0
c    2.0
dtype: float64

# drop: DataFrame

In [17]:
b = pd.DataFrame(np.arange(16).reshape(4,4),
                index = list('abcd'),
                columns = list('abcd'.upper()))
b

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [19]:
b.drop(['A','C'], axis=1)

    B   D
a   1   3
b   5   7
c   9  11
d  13  15

In [20]:
b.drop(['a','c'], axis=0)

    A   B   C   D
b   4   5   6   7
d  12  13  14  15

# DataFrame: indexing, slicing

In [21]:
b

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [22]:
b['B']

a     1
b     5
c     9
d    13
Name: B, dtype: int32

In [23]:
b[0:1]

   A  B  C  D
a  0  1  2  3

In [24]:
b['a':'b']

   A  B  C  D
a  0  1  2  3
b  4  5  6  7

In [25]:
b['A']

a     0
b     4
c     8
d    12
Name: A, dtype: int32

In [26]:
b[['A']]

    A
a   0
b   4
c   8
d  12

In [27]:
b[['A','D']]

    A   D
a   0   3
b   4   7
c   8  11
d  12  15

# loc

In [28]:
b.loc['a']

A    0
B    1
C    2
D    3
Name: a, dtype: int32

In [29]:
b.loc['a','B':'C']

B    1
C    2
Name: a, dtype: int32

In [30]:
b.loc['a':'b', 'B':'C']

   B  C
a  1  2
b  5  6

In [32]:
b.loc[:,'B']

a     1
b     5
c     9
d    13
Name: B, dtype: int32

In [33]:
b.loc[['a'],['B']]

   B
a  1

# iloc

In [34]:
b.iloc[0]

A    0
B    1
C    2
D    3
Name: a, dtype: int32

In [35]:
b.iloc[0,1]

1

In [36]:
b.iloc[0:1,1:2]

   B
a  1

In [37]:
b.iloc[:,1]

a     1
b     5
c     9
d    13
Name: B, dtype: int32

In [38]:
b.iloc[[0],[1]]

   B
a  1

# 연습문제 2
### 1. 8개 파일 중 확장자 txt 파일 4개 불러오기
### 2. 텍스트 소문자 변환 후 어휘 단위 분리
### 3. 어휘 앞 그리고 뒤의 문장부호 하나 이상 연쇄 제거
### 4. 4개 파일의 어휘별 빈도 DataFrame TDM을 만드시오
### 5. 어휘를 알파벳 오름차순 정렬, Nan을 0으로 치환, dtype을 정수로 변환
### 6. 칼럼 이름을 Files, 행 이름을 Words로 할당

In [42]:
import os, re
import pandas as pd
from collections import Counter
Freq = {i: Counter(re.sub('^\W+|\W+$','',j)
                  for j in open('./01_data/'+i).read().lower().split())
       for i in os.listdir('./01_data') if i.endswith('.txt')}
TDM = pd.DataFrame(Freq)
TDM.columns.name = 'Files'
TDM.index.name = 'Words'
TDM = TDM.reindex(sorted(TDM.index)).fillna(0).astype('int')

In [43]:
TDM

Files  01.txt  02.txt  03.txt  04.txt
Words
14th        0       0       0       1
15          0       0       0       1
1656        0       0       0       1
1761        0       0       0       1
17th        0       0       0       1
...       ...     ...     ...     ...
years       2       0       0       0
york        0       0       1       0
you         4       0       0       0
young       0       1       0       0
your        5       0       0       0

[244 rows x 4 columns]

# 연습문제 3
### TDM으로부터 다음과 같이 숫자로만 구성된 어휘의 DataFrame과 문장부호가 포함된 어휘의 DataFrame을 추출하시오.

In [44]:
import re
import pandas as pd
TDM.drop([i for i in TDM.index if re.search('\D',i)])

Files  01.txt  02.txt  03.txt  04.txt
Words
15          0       0       0       1
1656        0       0       0       1
1761        0       0       0       1
1979        1       0       0       0
1992        1       0       0       0
25          1       0       0       0

In [45]:
TDM.loc[[i for i in TDM.index if re.search('\W',i)]]

Files           01.txt  02.txt  03.txt  04.txt
Words
artist's             0       0       2       0
navigator's          0       0       0       1
old-fashioned        0       1       0       0
print-oriented       0       1       0       0
well-earned          1       0       0       0